{
    "slug": "gdxvania-arcade-homage-game",
    "title": "GDXvania: An Arcade-Style Homage Game",
    "highlighted": false,
    "description": "Developed 'GDXvania,' an arcade-style homage to classic old-school action games, as a university assignment. Built with the libGDX framework, it focuses on core gameplay, simplified controls, single-screen design, and atmospheric presentation, culminating in a challenging boss fight.",    
    "liveUrl": null,
    "githubUrl": "https://github.com/lorenzomaiuri-dev/GDXvania",
    "technologies": ["Java", "libGDX", "Game Development", "Gradle", "Object-Oriented Programming", "Game Design", "2D Graphics", "Sound Design"],
    "sections": [
      {
        "title": "Introduction",
        "content": "'GDXvania' is a fan-made, arcade-style interpretation of classic old-school action games, developed as a university assignment. Built using the libGDX game development framework, and leveraging the project structure generated by gdx-liftoff, this project aims to encapsulate the essence of beloved retro titles in a simplified, action-oriented format."
      },
      {
        "title": "Scope of the Project",
        "content": "This project's primary goal is to recreate the core gameplay loop and atmospheric presentation of classic action games in a streamlined, arcade-friendly experience. Key aspects explored during development include:\n\nSimplified Controls: Implementing intuitive and responsive controls optimized for quick, action-oriented gameplay, making it accessible and engaging.\nSingle Screen Design: The entire game unfolds on a single, focused screen, emphasizing immediate action and strategic combat.\nLinear Progression to Boss Encounter: The gameplay is structured to build score and challenge, culminating in a demanding and memorable boss fight.\nCombat Mechanics: Developing engaging combat against iconic monsters, featuring a primary weapon and the potential for sub-weapons to add tactical depth.\nAtmospheric Presentation: Evoking a dark and gothic aesthetic through carefully crafted visuals and sound design, immersing the player in the game world.\n\nPlease note that this is a non-commercial, educational project."
      },
      {
        "title": "Platform Support",
        "content": "The project is structured to support multiple platforms, leveraging libGDX's cross-platform capabilities:\n\ncore: Contains the main game logic, designed to be shared seamlessly across all supported platforms.\nlwjgl3: Provides support for desktop platforms, including Windows, macOS, and Linux.\nandroid: (Work in Progress) Aimed at extending support to Android mobile devices.\nhtml: Enables gameplay directly within web browsers, utilizing GWT and WebGL for rendering."
      },
      {
        "title": "Development & Build System",
        "content": "The project utilizes Gradle as its build automation tool, simplifying dependency management and build processes. The inclusion of the Gradle wrapper (`gradlew.bat` or `./gradlew`) ensures that anyone can easily run Gradle tasks without a local Gradle installation."
      },
      {
        "title": "Skills Used",
        "content": "Java, libGDX, Game Development, Gradle, Object-Oriented Programming (OOP), 2D Game Design Principles, Combat System Design, UI/UX for Games, Sound Design, Cross-Platform Development (conceptual)."
      },
      {
        "title": "Outcomes",
        "listItems": [
          "Core Gameplay Implementation: Successfully implemented the core gameplay loop, including responsive controls, combat mechanics, and level progression, capturing the essence of classic arcade action.",
          "Atmospheric Experience: Created a visually and aurally cohesive game environment that effectively evokes the desired dark and gothic atmosphere.",
          "Cross-Platform Architecture: Developed a project structure ready for deployment across multiple platforms, demonstrating proficiency in libGDX's cross-platform capabilities.",
          "Educational Project Success: Fulfilled the requirements of a university assignment by delivering a functional and engaging game, showcasing practical application of game development principles."
        ]
      }
    ]
  }